In [1]:
import numpy as np
import pandas as pd

In [3]:
# Indexação hierárquica

In [2]:
data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    2.098001
   2   -1.306197
   3    0.794377
b  1   -0.389521
   3   -0.658657
c  1   -0.195786
   2    1.108271
d  2    0.902423
   3    1.493582
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [4]:
data['b']

1   -0.389521
3   -0.658657
dtype: float64

In [5]:
data['b':'c']

b  1   -0.389521
   3   -0.658657
c  1   -0.195786
   2    1.108271
dtype: float64

In [6]:
data.loc[['b', 'd']]

b  1   -0.389521
   3   -0.658657
d  2    0.902423
   3    1.493582
dtype: float64

In [7]:
data.loc[:, 2]

a   -1.306197
c    1.108271
d    0.902423
dtype: float64

In [9]:
data

a  1    2.098001
   2   -1.306197
   3    0.794377
b  1   -0.389521
   3   -0.658657
c  1   -0.195786
   2    1.108271
d  2    0.902423
   3    1.493582
dtype: float64

In [11]:
data.unstack() # index vira coluna

          1         2         3
a  2.098001 -1.306197  0.794377
b -0.389521       NaN -0.658657
c -0.195786  1.108271       NaN
d       NaN  0.902423  1.493582

In [12]:
data.unstack().stack() # operação inversa de unstack é stack

a  1    2.098001
   2   -1.306197
   3    0.794377
b  1   -0.389521
   3   -0.658657
c  1   -0.195786
   2    1.108271
d  2    0.902423
   3    1.493582
dtype: float64

In [18]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns=[['Ohio', 'Ohio', 'Colorado'],
                            ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [19]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [21]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [23]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [26]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [2]:
# concat

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [4]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
pd.concat([df1, df2, df3]) # mesmas colunas diferentes indices

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11